markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_pwm.h
/**
 * Defines for the bit fields in the PWM_O_X_GENA register.
 */
#define PWM_X_GENA_ACTCMPBD_M    0x00000C00  //< Action for Comparator B Down
#define PWM_X_GENA_ACTCMPBD_NONE 0x00000000  //< Do nothing
#define PWM_X_GENA_ACTCMPBD_INV  0x00000400  //< Invert pwmA
#define PWM_X_GENA_ACTCMPBD_ZERO 0x00000800  //< Drive pwmA Low
#define PWM_X_GENA_ACTCMPBD_ONE  0x00000C00  //< Drive pwmA High
#define PWM_X_GENA_ACTCMPBU_M    0x00000300  //< Action for Comparator B Up
#define PWM_X_GENA_ACTCMPBU_NONE 0x00000000  //< Do nothing
#define PWM_X_GENA_ACTCMPBU_INV  0x00000100  //< Invert pwmA
#define PWM_X_GENA_ACTCMPBU_ZERO 0x00000200  //< Drive pwmA Low
#define PWM_X_GENA_ACTCMPBU_ONE  0x00000300  //< Drive pwmA High
#define PWM_X_GENA_ACTCMPAD_M    0x000000C0  //< Action for Comparator A Down
#define PWM_X_GENA_ACTCMPAD_NONE 0x00000000  //< Do nothing
#define PWM_X_GENA_ACTCMPAD_INV  0x00000040  //< Invert pwmA
#define PWM_X_GENA_ACTCMPAD_ZERO 0x00000080  //< Drive pwmA Low
#define PWM_X_GENA_ACTCMPAD_ONE  0x000000C0  //< Drive pwmA High
#define PWM_X_GENA_ACTCMPAU_M    0x00000030  //< Action for Comparator A Up
#define PWM_X_GENA_ACTCMPAU_NONE 0x00000000  //< Do nothing
#define PWM_X_GENA_ACTCMPAU_INV  0x00000010  //< Invert pwmA
#define PWM_X_GENA_ACTCMPAU_ZERO 0x00000020  //< Drive pwmA Low
#define PWM_X_GENA_ACTCMPAU_ONE 0x00000030  //< Drive pwmA High
#define PWM_X_GENA_ACTLOAD_M    0x0000000C  //< Action for Counter=LOAD
#define PWM_X_GENA_ACTLOAD_NONE 0x00000000  //< Do nothing
#define PWM_X_GENA_ACTLOAD_INV  0x00000004  //< Invert pwmA
#define PWM_X_GENA_ACTLOAD_ZERO 0x00000008  //< Drive pwmA Low
#define PWM_X_GENA_ACTLOAD_ONE  0x0000000C  //< Drive pwmA High
#define PWM_X_GENA_ACTZERO_M    0x00000003  //< Action for Counter=0
#define PWM_X_GENA_ACTZERO_NONE 0x00000000  //< Do nothing
#define PWM_X_GENA_ACTZERO_INV  0x00000001  //< Invert pwmA
#define PWM_X_GENA_ACTZERO_ZERO 0x00000002  //< Drive pwmA Low
#define PWM_X_GENA_ACTZERO_ONE  0x00000003  //< Drive pwmA High

/**
 * Defines for the bit fields in the PWM_O_X_GENB register.
 */
#define PWM_X_GENB_ACTCMPBD_M   0x00000C00  //< Action for Comparator B Down
#define PWM_X_GENB_ACTCMPBD_NONE 0x00000000  //< Do nothing
#define PWM_X_GENB_ACTCMPBD_INV 0x00000400  //< Invert pwmB
#define PWM_X_GENB_ACTCMPBD_ZERO 0x00000800  //< Drive pwmB Low
#define PWM_X_GENB_ACTCMPBD_ONE 0x00000C00  //< Drive pwmB High
#define PWM_X_GENB_ACTCMPBU_M   0x00000300  //< Action for Comparator B Up
#define PWM_X_GENB_ACTCMPBU_NONE 0x00000000  //< Do nothing
#define PWM_X_GENB_ACTCMPBU_INV 0x00000100  //< Invert pwmB
#define PWM_X_GENB_ACTCMPBU_ZERO 0x00000200  //< Drive pwmB Low
#define PWM_X_GENB_ACTCMPBU_ONE 0x00000300  //< Drive pwmB High
#define PWM_X_GENB_ACTCMPAD_M   0x000000C0  //< Action for Comparator A Down
#define PWM_X_GENB_ACTCMPAD_NONE 0x00000000  //< Do nothing
#define PWM_X_GENB_ACTCMPAD_INV 0x00000040  //< Invert pwmB
#define PWM_X_GENB_ACTCMPAD_ZERO 0x00000080  //< Drive pwmB Low
#define PWM_X_GENB_ACTCMPAD_ONE 0x000000C0  //< Drive pwmB High
#define PWM_X_GENB_ACTCMPAU_M   0x00000030  //< Action for Comparator A Up
#define PWM_X_GENB_ACTCMPAU_NONE 0x00000000  //< Do nothing
#define PWM_X_GENB_ACTCMPAU_INV 0x00000010  //< Invert pwmB
#define PWM_X_GENB_ACTCMPAU_ZERO 0x00000020  //< Drive pwmB Low
#define PWM_X_GENB_ACTCMPAU_ONE 0x00000030  //< Drive pwmB High
#define PWM_X_GENB_ACTLOAD_M    0x0000000C  //< Action for Counter=LOAD
#define PWM_X_GENB_ACTLOAD_NONE 0x00000000  //< Do nothing
#define PWM_X_GENB_ACTLOAD_INV  0x00000004  //< Invert pwmB
#define PWM_X_GENB_ACTLOAD_ZERO 0x00000008  //< Drive pwmB Low
#define PWM_X_GENB_ACTLOAD_ONE  0x0000000C  //< Drive pwmB High
#define PWM_X_GENB_ACTZERO_M    0x00000003  //< Action for Counter=0
#define PWM_X_GENB_ACTZERO_NONE 0x00000000  //< Do nothing
#define PWM_X_GENB_ACTZERO_INV  0x00000001  //< Invert pwmB
#define PWM_X_GENB_ACTZERO_ZERO 0x00000002  //< Drive pwmB Low
#define PWM_X_GENB_ACTZERO_ONE  0x00000003  //< Drive pwmB High

/**
 * Defines for the bit fields in the PWM_O_X_DBCTL register.
 */
#define PWM_X_DBCTL_ENABLE      0x00000001  //< Dead-Band Generator Enable
/**
 * Defines for the bit fields in the PWM_O_X_DBRISE register.
 */
#define PWM_X_DBRISE_DELAY_M    0x00000FFF  //< Dead-Band Rise Delay
#define PWM_X_DBRISE_DELAY_S    0

/**
 * Defines for the bit fields in the PWM_O_X_DBFALL register.
 */
#define PWM_X_DBFALL_DELAY_M    0x00000FFF  //< Dead-Band Fall Delay
#define PWM_X_DBFALL_DELAY_S    0

/**
 * Defines for the bit fields in the PWM_O_X_FLTSRC0 register.
 */
#define PWM_X_FLTSRC0_FAULT3    0x00000008  //< Fault3 Input
#define PWM_X_FLTSRC0_FAULT2    0x00000004  //< Fault2 Input
#define PWM_X_FLTSRC0_FAULT1    0x00000002  //< Fault1 Input
#define PWM_X_FLTSRC0_FAULT0    0x00000001  //< Fault0 Input

/**
 * The following are defines for the bit fields in the PWM_O_X_FLTSRC1 register.
 */
#define PWM_X_FLTSRC1_DCMP7     0x00000080  //< Digital Comparator 7
#define PWM_X_FLTSRC1_DCMP6     0x00000040  //< Digital Comparator 6
#define PWM_X_FLTSRC1_DCMP5     0x00000020  //< Digital Comparator 5
#define PWM_X_FLTSRC1_DCMP4     0x00000010  //< Digital Comparator 4
#define PWM_X_FLTSRC1_DCMP3     0x00000008  //< Digital Comparator 3
#define PWM_X_FLTSRC1_DCMP2     0x00000004  //< Digital Comparator 2
#define PWM_X_FLTSRC1_DCMP1     0x00000002  //< Digital Comparator 1
#define PWM_X_FLTSRC1_DCMP0     0x00000001  //< Digital Comparator 0

/**
 * Defines for the bit fields in the PWM_O_X_MINFLTPER register.
 */
#define PWM_X_MINFLTPER_M       0x0000FFFF  //< Minimum Fault Period
#define PWM_X_MINFLTPER_S       0

/**
 * Defines for the bit fields in the PWM_O_X_FLTSEN register.
 */
#define PWM_X_FLTSEN_FAULT3     0x00000008  //< Fault3 Sense
#define PWM_X_FLTSEN_FAULT2     0x00000004  //< Fault2 Sense
#define PWM_X_FLTSEN_FAULT1     0x00000002  //< Fault1 Sense
#define PWM_X_FLTSEN_FAULT0     0x00000001  //< Fault0 Sense

/**
 * Defines for the bit fields in the PWM_O_X_FLTSTAT0 register.
 */
#define PWM_X_FLTSTAT0_FAULT3   0x00000008  //< Fault Input 3
#define PWM_X_FLTSTAT0_FAULT2   0x00000004  //< Fault Input 2
#define PWM_X_FLTSTAT0_FAULT1   0x00000002  //< Fault Input 1
#define PWM_X_FLTSTAT0_FAULT0   0x00000001  //< Fault Input 0

/**
 * Defines for the bit fields in the PWM_O_X_FLTSTAT1 register.
 */
#define PWM_X_FLTSTAT1_DCMP7    0x00000080  //< Digital Comparator 7 Trigger
#define PWM_X_FLTSTAT1_DCMP6    0x00000040  //< Digital Comparator 6 Trigger
#define PWM_X_FLTSTAT1_DCMP5    0x00000020  //< Digital Comparator 5 Trigger
#define PWM_X_FLTSTAT1_DCMP4    0x00000010  //< Digital Comparator 4 Trigger
#define PWM_X_FLTSTAT1_DCMP3    0x00000008  //< Digital Comparator 3 Trigger
#define PWM_X_FLTSTAT1_DCMP2    0x00000004  //< Digital Comparator 2 Trigger
#define PWM_X_FLTSTAT1_DCMP1    0x00000002  //< Digital Comparator 1 Trigger
#define PWM_X_FLTSTAT1_DCMP0    0x00000001  //< Digital Comparator 0 Trigger

/**
 * Defines for the PWM Generator standard offsets.
 */
#define PWM_O_X_CTL             (*((reg32_t *)(PWMC_BASE + 0x00000000)))  //< Gen Control Reg
#define PWM_O_X_INTEN           (*((reg32_t *)(PWMC_BASE + 0x00000004)))  //< Gen Int/Trig Enable Reg
#define PWM_O_X_RIS             (*((reg32_t *)(PWMC_BASE + 0x00000008)))  //< Gen Raw Int Status Reg
#define PWM_O_X_ISC             (*((reg32_t *)(PWMC_BASE + 0x0000000C)))  //< Gen Int Status Reg
#define PWM_O_X_LOAD            (*((reg32_t *)(PWMC_BASE + 0x00000010)))  //< Gen Load Reg
#define PWM_O_X_COUNT           (*((reg32_t *)(PWMC_BASE + 0x00000014)))  //< Gen Counter Reg
#define PWM_O_X_CMPA            (*((reg32_t *)(PWMC_BASE + 0x00000018)))  //< Gen Compare A Reg
#define PWM_O_X_CMPB            (*((reg32_t *)(PWMC_BASE + 0x0000001C)))  //< Gen Compare B Reg
#define PWM_O_X_GENA            (*((reg32_t *)(PWMC_BASE + 0x00000020)))  //< Gen Generator A Ctrl Reg
#define PWM_O_X_GENB            (*((reg32_t *)(PWMC_BASE + 0x00000024)))  //< Gen Generator B Ctrl Reg
#define PWM_O_X_DBCTL           (*((reg32_t *)(PWMC_BASE + 0x00000028)))  //< Gen Dead Band Ctrl Reg
#define PWM_O_X_DBRISE          (*((reg32_t *)(PWMC_BASE + 0x0000002C)))  //< Gen DB Rising Edge Delay Reg
#define PWM_O_X_DBFALL          (*((reg32_t *)(PWMC_BASE + 0x00000030)))  //< Gen DB Falling Edge Delay Reg
#define PWM_O_X_FLTSRC0         (*((reg32_t *)(PWMC_BASE + 0x00000034)))  //< Fault pin, comparator condition
#define PWM_O_X_FLTSRC1         (*((reg32_t *)(PWMC_BASE + 0x00000038)))  //< Digital comparator condition
#define PWM_O_X_MINFLTPER       (*((reg32_t *)(PWMC_BASE + 0x0000003C)))  //< Fault minimum period extension
#define PWM_GEN_0_OFFSET        (*((reg32_t *)(PWMC_BASE + 0x00000040)))  //< PWM0 base
#define PWM_GEN_1_OFFSET        (*((reg32_t *)(PWMC_BASE + 0x00000080)))  //< PWM1 base
#define PWM_GEN_2_OFFSET        (*((reg32_t *)(PWMC_BASE + 0x000000C0)))  //< PWM2 base
#define PWM_GEN_3_OFFSET        (*((reg32_t *)(PWMC_BASE + 0x00000100)))  //< PWM3 base

/**
 * Defines for the PWM Generator extended offsets.
 */
#define PWM_O_X_FLTSEN          (*((reg32_t *)(PWMC_BASE + 0x00000000)))  //< Fault logic sense
#define PWM_O_X_FLTSTAT0        (*((reg32_t *)(PWMC_BASE + 0x00000004)))  //< Pin and comparator status
#define PWM_O_X_FLTSTAT1        (*((reg32_t *)(PWMC_BASE + 0x00000008)))  //< Digital comparator status
#define PWM_EXT_0_OFFSET        (*((reg32_t *)(PWMC_BASE + 0x00000800)))  //< PWM0 extended base
#define PWM_EXT_1_OFFSET        (*((reg32_t *)(PWMC_BASE + 0x00000880)))  //< PWM1 extended base
#define PWM_EXT_2_OFFSET        (*((reg32_t *)(PWMC_BASE + 0x00000900)))  //< PWM2 extended base
#define PWM_EXT_3_OFFSET        (*((reg32_t *)(PWMC_BASE + 0x00000980)))  //< PWM3 extended base

#endif /* LM3S_PWM_H */
